---
type: DetailElementOrderUtils
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# DetailElementOrderUtils

`Autodesk.Revit.DB.DetailElementOrderUtils` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Method | AreDetailElements | 2014 | `public static bool AreDetailElements ( Document document , View view , ICollection < ElementId > detailElementIds )` |
| Method | BringForward | — | `` |
| Method | BringToFront | — | `` |
| Method | GetDrawOrderForDetails | 2024 | `public static IList < ElementId > GetDrawOrderForDetails ( View view , ISet < ElementId > detailIdsToSort )` |
| Method | IsDetailElement | 2013 | `public static bool IsDetailElement ( Document document , View view , ElementId detailElementId )` |
| Method | SendBackward | — | `` |
| Method | SendToBack | — | `` |